corr_thr = 0.2
psi_thr = 0.1
perm_thr = 0.05
data_split = [0.6, 0.2, 0.2]


data_split = f"Выборки были разделены в пропорции " \
             f"{data_split} на train, valid, test соответственно"


data_transform = f"- удаление фичей, указанных в списке drop_features " \
                 f"{chr(10)} - применение CategoricalFeatureTransformer " \
                 f"(модернизированный LabelEncoder)"


modelling = {
    ".": f" - построение модели на признаках, отобранных по PSI " 
         f"{chr(10)} "
         f"- построение модели на признаках, отобранных по " 
         f"перестановкам {chr(10)}",
    ".PSI": f" - построение модели на признаках, отобранных по PSI ",
    ".OPTIMIZED": f" - построение модели на признаках, отобранных по PSI " 
                  f"{chr(10)} "
                  f"- построение модели на признаках, отобранных по " 
                  f"перестановкам {chr(10)} " 
                  f"- оптимизация гиперпараметров модели"
}


features_steps = {
    ".": f"- Отбор признаков по корреляции, "
         f"(пороговое значение -{corr_thr}){chr(10)}"
         f"- Отбор признаков по PSI, (пороговое значение - {psi_thr})"
         f"{chr(10)}"
         f"- Отбор признаков по перестановкам, (пороговое значение -"
         f"{perm_thr})",

    ".PSI": f"- Отбор признаков по корреляции, "
            f"(пороговое значение -{corr_thr}){chr(10)}"
            f"- Отбор признаков по PSI, (пороговое значение - {psi_thr})"
            f"{chr(10)}",

    ".OPTIMIZED": f"- Отбор признаков по корреляции, "
                  f"(пороговое значение -{corr_thr}){chr(10)}"
                  f"- Отбор признаков по PSI, (пороговое значение - {psi_thr})"
                  f"{chr(10)}"
                  f"- Отбор признаков по перестановкам, (пороговое значение -"
                  f"{perm_thr})"
}


hyper_paramas = {
    "XGB":   f"max_depth: (3, 6), {chr(10)} "
             f"min_child_weights: (100, 2500), {chr(10)}"
             f" reg_lambda: (5, 500), gamma: (1, 100)",

    "CatBoost":  f"max_depth: (3, 7),{chr(10)} "
                 f"l2_leaf_reg: (1, 250),{chr(10)}"
                 f" colsample_bylevel: (0.7, 0.9)"
}

